# 49: Seleksi kolom dengan f-string
# Import Modules

In [24]:
import pandas as pd

print(pd.__version__)

2.3.3

# Persiapan Data Frame

In [25]:
df = pd.read_csv('../DATTA/Iris.csv')
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

# Seleksi kolom dengan f-string

In [26]:
df['SepalWidthCm'].to_frame().head()

   SepalWidthCm
0           3.5
1           3.0
2           3.2
3           3.1
4           3.6

In [27]:
part = 'Sepal'

df[f'{part}WidthCm'].to_frame().head()

   SepalWidthCm
0           3.5
1           3.0
2           3.2
3           3.1
4           3.6

In [28]:
df[['PetalWidthCm', 'PetalLengthCm']].head()

   PetalWidthCm  PetalLengthCm
0           0.2            1.4
1           0.2            1.4
2           0.2            1.3
3           0.2            1.5
4           0.2            1.4

In [29]:
part = 'Petal'

df[[f'{part}WidthCm', f'{part}LengthCm']].head()

   PetalWidthCm  PetalLengthCm
0           0.2            1.4
1           0.2            1.4
2           0.2            1.3
3           0.2            1.5
4           0.2            1.4

# 50: Membuat kolom baru dengan looping dan f-string
# Import Modules

In [30]:
import pandas as pd

print(pd.__version__)

2.3.3

# Persiapan Data Frame

In [31]:
d = {'penjual':['bejo', 'tejo', 'wati', 'bejo', 'cecep', 'tejo', 'wati', 'bejo'], 
     'barang':['monitor', 'monitor', 'keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}

df = pd.DataFrame(d)
df

  penjual    barang
0    bejo   monitor
1    tejo   monitor
2    wati  keyboard
3    bejo     mouse
4   cecep  keyboard
5    tejo   monitor
6    wati    laptop
7    bejo   monitor

# Membuat kolom baru dengan for loop dan f-string

In [32]:
cols = ['penjual', 'barang']

for col in cols:
    df[f'count_tiap_{col}'] =  df.groupby(col).cumcount() + 1
    
df

  penjual    barang  count_tiap_penjual  count_tiap_barang
0    bejo   monitor                   1                  1
1    tejo   monitor                   1                  2
2    wati  keyboard                   1                  1
3    bejo     mouse                   2                  1
4   cecep  keyboard                   1                  2
5    tejo   monitor                   2                  3
6    wati    laptop                   2                  1
7    bejo   monitor                   3                  4

# 51: Seleksi baris dengan between()
# Import Modules

In [33]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

# Persiapan Data Frame

In [34]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  5  4  2  3  7
1  2  6  8  9  3
2  8  8  1  2  3
3  5  2  9  1  6
4  5  2  3  9  4
5  9  5  1  4  5
6  6  1  6  2  4
7  7  5  6  3  2
8  5  1  9  1  9
9  5  2  3  8  4

# Seleksi baris dengan between()

In [35]:
df[df['A'].between(2, 5)]

   A  B  C  D  E
0  5  4  2  3  7
1  2  6  8  9  3
3  5  2  9  1  6
4  5  2  3  9  4
8  5  1  9  1  9
9  5  2  3  8  4

In [36]:
## DEPRICATED ##
# df[df['A'].between(2, 5, inclusive=False)]

In [37]:
df[df['A'].between(2, 5, inclusive='left')]

   A  B  C  D  E
1  2  6  8  9  3

In [38]:
df[df['A'].between(2, 5, inclusive='right')]

   A  B  C  D  E
0  5  4  2  3  7
3  5  2  9  1  6
4  5  2  3  9  4
8  5  1  9  1  9
9  5  2  3  8  4

In [39]:
df[df['A'].between(2, 5, inclusive='both')]

   A  B  C  D  E
0  5  4  2  3  7
1  2  6  8  9  3
3  5  2  9  1  6
4  5  2  3  9  4
8  5  1  9  1  9
9  5  2  3  8  4

In [40]:
df[df['A'].between(2, 5, inclusive='neither')]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

# 52: Transformasi kolom menjadi baris pada Data Frame
# Import Modules

In [41]:
import pandas as pd

print(pd.__version__)

2.3.3

# Persiapan Data Frame

In [42]:
d = {
'kode_area': [123, 456, 789, 321],
'pabrik': [4, 2, 5, 0],
'gudang': [2, 4, 7, 3],
'toko': [64, 32, 15, 24]
}

df = pd.DataFrame(d)
df

   kode_area  pabrik  gudang  toko
0        123       4       2    64
1        456       2       4    32
2        789       5       7    15
3        321       0       3    24

# Transformasi kolom menjadi baris

In [43]:
df = df.melt(id_vars='kode_area', 
             var_name='jenis_bangunan', 
             value_name='jumlah')
df

    kode_area jenis_bangunan  jumlah
0         123         pabrik       4
1         456         pabrik       2
2         789         pabrik       5
3         321         pabrik       0
4         123         gudang       2
5         456         gudang       4
6         789         gudang       7
7         321         gudang       3
8         123           toko      64
9         456           toko      32
10        789           toko      15
11        321           toko      24